import React, { useState } from "react";
import Topbar from "../layout/Topbar";
import ListCard from "../components/all/ListCard";
import { Row, Col, Input } from "antd";
import "antd/dist/antd.css";
import styled from "styled-components";

const { Search } = Input;
const StyledWrapper = styled.section`
  .main {
    font-family: "K2D", sans-serif;
    display: flex;
    justify-content: center;
    margin: 20px 0;
  }
  .main-width {
    width: 1000px;
  }
  .header-text {
    font-size: 30px;
    font-weight: bold;
    margin: 10px 5px 20px 5px !important;
  }
  .row-header {
    display: flex;
    align-items: flex-end !important;
  }

  .gutter-row {
    padding: 5px 10px;
  }
  .slide-card {
    width: 100%;
    height: 120px;
  }
`;
const Home = () => {
  const data = [
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2021/03/1-DEW_9667.jpg",
      title: "แหลมกระทิง ",
      des:
        " อีกหนึ่งจุดชมวิวพระอาทิตย์ตกที่สวยงามที่สุดแห่งหนึ่งของภูเก็ต มองเห็นวิวท้องทะเลสีน้ำเงินเข้ม แหลมพรมเทพ และเกาะที่อยู่ตรงหน้า ความพิเศษของจุดชมวิวแห่งนี้ คือ ความงดงามของทุ่งหญ้าสีทองพริ้วไหว และโขดหินน้อยใหญ่ระหว่างทางเดินให้เราได้แทรกตัวในทุ่งหญ้าถ่ายรูปเคล้าแสงยามเย็นได้แบบคูลๆ  รวมทั้งก้อนหินไฮไลท์   ยอดแหลมชี้ขึ้นฟ้า ที่ตั้งโดดเด่นยื่นไปทางทะเล ด้วยความสวยงามแปลกตา จุดชมวิวแห่งนี้จึงกลายเป็นจุดชมวิวยอดนิยมที่สุดของนักท่องเที่ยวที่มาเที่ยวภูเก็ต",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/DSC_5563-800x536.jpg",
      title: "แหลมพรหมเทพ ",
      des:
        "แหลมพรหมเทพ จุดชมอาทิตย์ตกที่อยู่ใต้สุดของเกาะภูเก็ตห่างจากตัวเมือง มีลักษณะเป็นแหลมโค้งไล่ระดับทอดตัวสู่ท้องทะเล รอบข้างแวดล้อมด้วยต้นตาลที่ขึ้นแทรกอยู่เรียงรายตาม ต้นหญ้าที่พัดพลิ้วด้านขวาเป็นหาดในหานและเกาะมัน ส่วนด้านซ้ายจะมองเห็นหาดในยะซึ่งเป็นหาดเล็ก ๆโดย ทั่วไป นักท่องเที่ยวไม่ว่าจะเที่ยวหรือพักที่หาดใด พอช่วงใกล้เย็นพากันมาชมพระอาทิตย์ตกที่แหลมพรหมเทพ",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/DEW_7864-800x533.jpg",
      title: "จุดชมวิวกังหันลม ",
      des:
        "จุดชมวิวกังหันลม ตั้งอยู่บนเนินเขาระหว่างหาดยะนุ้ยและหาดในหาน ไม่ไกลจากแหลมพรหมเทพ ในบริเวณที่มีการผลิตกระแสไฟ้ฟ้าจากกังหันลม สามารถมองเห็นวิวทะเลได้กว้างไกลสุดตา จากจุดชมวิวกังหันลมสามารถมองเห็นแหลมพรหมเทพ หาดยะนุ้ย และหาดไนหาน พร้อมกับวิวฉากหน้าที่เต็มไปด้วยดอกหญ้าพริ้วไหว  และยังได้เห็นกังหันลมที่ใช้ในการผลิตกระแสไฟฟ้านั้นมีขนาดใหญ่แค่ไหน ในช่วงกลางวันสามารถมองเห็นทะเลสีฟ้าคราม และเกาะที่ทอดยาวจากฝั่งไปยังทะเล เรือยอร์ชที่เรียงรายหลางทะเล กลายเป็นองค์ประกอบที่ลงตัว  ในช่วงเวลาเย็นยังเป็นจุดชมพระอาทิตย์ตกได้อย่างสวยงามอีกด้วย",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/kaokhad13-800x530.jpg",
      title: "จุดชมวิวเขาช่องขาด ",
      des:
        "จุดชมวิวเขาช่องขาด เป็นจุดชมวิวอีกแห่งหนึ่ง ของจังหวัดภูเก็ต ตั้งอยู่ในอำเภอเมืองในบริเวณ อ่าวมะขามใกล้กับแหลมพันวา จุดชมวิวเขาขาดเป็นจุดชมวิวที่สวยงามอีกแห่งหนึ่ง ของเมืองภูเก็ตที่มีจุดชมวิวมากมาย แต่มีเพียง ไม่กี่แห่งที่สามารถชมวิวได้ 360 องศา และแน่นอนว่าชมวิวได้ 360 องศาอย่างแท้จริงที่นี่คือ “จุดชมวิวเขาขาด” เป็นมุมมองที่มีเสน่ห์ ไม่แพ้จุดอื่นของภูเก็ตเลยทีเดียว",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/DSC_5701-800x536.jpg",
      title: "จุดชมวิว 3 อ่าว ",
      des:
        "จุดชมวิวเขาสามอ่าว อีกหนึ่งจุดชมวิวขึ้นชื่อของภูเก็ต สามารถมองเห็นทิวทัศน์ของเวิ้งอ่าว 3 อ่าว ได้แก่ อ่าวกะตะน้อย อ่าวกะตะ และอ่าวกะรน ซึ่งเป็นทัศนียภาพที่สวยงามมาก จนมักมีคนพูดกันว่า หากใครามาภูเก็ตแล้ว ไม่ได้มาถ่ายภาพที่จุดชมวิวแห่งนี้ ถือว่ามาไม่ถึงภูเก็ต จุดชมวิวสามอ่าวตั้งอยู่ระหว่างเส้นทางถนนรอบเกาะ จากหาดในหานไปหาดกะตะน้อย",
    },

    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2021/03/1-DEW_9667.jpg",
      title: "แหลมกระทิง ",
      des:
        " อีกหนึ่งจุดชมวิวพระอาทิตย์ตกที่สวยงามที่สุดแห่งหนึ่งของภูเก็ต มองเห็นวิวท้องทะเลสีน้ำเงินเข้ม แหลมพรมเทพ และเกาะที่อยู่ตรงหน้า ความพิเศษของจุดชมวิวแห่งนี้ คือ ความงดงามของทุ่งหญ้าสีทองพริ้วไหว และโขดหินน้อยใหญ่ระหว่างทางเดินให้เราได้แทรกตัวในทุ่งหญ้าถ่ายรูปเคล้าแสงยามเย็นได้แบบคูลๆ  รวมทั้งก้อนหินไฮไลท์   ยอดแหลมชี้ขึ้นฟ้า ที่ตั้งโดดเด่นยื่นไปทางทะเล ด้วยความสวยงามแปลกตา จุดชมวิวแห่งนี้จึงกลายเป็นจุดชมวิวยอดนิยมที่สุดของนักท่องเที่ยวที่มาเที่ยวภูเก็ต",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/DSC_5563-800x536.jpg",
      title: "แหลมพรหมเทพ ",
      des:
        "แหลมพรหมเทพ จุดชมอาทิตย์ตกที่อยู่ใต้สุดของเกาะภูเก็ตห่างจากตัวเมือง มีลักษณะเป็นแหลมโค้งไล่ระดับทอดตัวสู่ท้องทะเล รอบข้างแวดล้อมด้วยต้นตาลที่ขึ้นแทรกอยู่เรียงรายตาม ต้นหญ้าที่พัดพลิ้วด้านขวาเป็นหาดในหานและเกาะมัน ส่วนด้านซ้ายจะมองเห็นหาดในยะซึ่งเป็นหาดเล็ก ๆโดย ทั่วไป นักท่องเที่ยวไม่ว่าจะเที่ยวหรือพักที่หาดใด พอช่วงใกล้เย็นพากันมาชมพระอาทิตย์ตกที่แหลมพรหมเทพ",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/DEW_7864-800x533.jpg",
      title: "จุดชมวิวกังหันลม ",
      des:
        "จุดชมวิวกังหันลม ตั้งอยู่บนเนินเขาระหว่างหาดยะนุ้ยและหาดในหาน ไม่ไกลจากแหลมพรหมเทพ ในบริเวณที่มีการผลิตกระแสไฟ้ฟ้าจากกังหันลม สามารถมองเห็นวิวทะเลได้กว้างไกลสุดตา จากจุดชมวิวกังหันลมสามารถมองเห็นแหลมพรหมเทพ หาดยะนุ้ย และหาดไนหาน พร้อมกับวิวฉากหน้าที่เต็มไปด้วยดอกหญ้าพริ้วไหว  และยังได้เห็นกังหันลมที่ใช้ในการผลิตกระแสไฟฟ้านั้นมีขนาดใหญ่แค่ไหน ในช่วงกลางวันสามารถมองเห็นทะเลสีฟ้าคราม และเกาะที่ทอดยาวจากฝั่งไปยังทะเล เรือยอร์ชที่เรียงรายหลางทะเล กลายเป็นองค์ประกอบที่ลงตัว  ในช่วงเวลาเย็นยังเป็นจุดชมพระอาทิตย์ตกได้อย่างสวยงามอีกด้วย",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/kaokhad13-800x530.jpg",
      title: "จุดชมวิวเขาช่องขาด ",
      des:
        "จุดชมวิวเขาช่องขาด เป็นจุดชมวิวอีกแห่งหนึ่ง ของจังหวัดภูเก็ต ตั้งอยู่ในอำเภอเมืองในบริเวณ อ่าวมะขามใกล้กับแหลมพันวา จุดชมวิวเขาขาดเป็นจุดชมวิวที่สวยงามอีกแห่งหนึ่ง ของเมืองภูเก็ตที่มีจุดชมวิวมากมาย แต่มีเพียง ไม่กี่แห่งที่สามารถชมวิวได้ 360 องศา และแน่นอนว่าชมวิวได้ 360 องศาอย่างแท้จริงที่นี่คือ “จุดชมวิวเขาขาด” เป็นมุมมองที่มีเสน่ห์ ไม่แพ้จุดอื่นของภูเก็ตเลยทีเดียว",
    },
    {
      img:
        "https://www.paiduaykan.com/travel/wp-content/uploads/2020/03/DSC_5701-800x536.jpg",
      title: "จุดชมวิว 3 อ่าว ",
      des:
        "จุดชมวิวเขาสามอ่าว อีกหนึ่งจุดชมวิวขึ้นชื่อของภูเก็ต สามารถมองเห็นทิวทัศน์ของเวิ้งอ่าว 3 อ่าว ได้แก่ อ่าวกะตะน้อย อ่าวกะตะ และอ่าวกะรน ซึ่งเป็นทัศนียภาพที่สวยงามมาก จนมักมีคนพูดกันว่า หากใครามาภูเก็ตแล้ว ไม่ได้มาถ่ายภาพที่จุดชมวิวแห่งนี้ ถือว่ามาไม่ถึงภูเก็ต จุดชมวิวสามอ่าวตั้งอยู่ระหว่างเส้นทางถนนรอบเกาะ จากหาดในหานไปหาดกะตะน้อย",
    },
  ];
  const [search, setSearch] = useState<string>("");

  const randerItem = () => {
    console.log("test");
    return data
      .filter((item) => {
        return item?.title?.indexOf(search) >= 0;
      })
      .map((item, index) => {
        return (
          <Col key={index} className="gutter-row" xs={12} sm={12} md={6}>
            <ListCard img={item.img} title={item.title} des={item.des} />
          </Col>
        );
      });
  };
  return (
    <StyledWrapper>
      <header>
        <Topbar />
      </header>
      <section className="main">
        <div className="main-width">
          <header className="header-text">
            <Row>
              <Col xs={12} sm={12} md={16} className="row-header">
                <span> สถานที่ </span>
              </Col>
              <Col xs={12} sm={12} md={8} className="row-header">
                <Search
                  value={search}
                  onChange={(e) => setSearch(e.target.value)}
                  enterButton
                />
              </Col>
            </Row>
          </header>
          <Row>{randerItem()}</Row>
        </div>
      </section>
    </StyledWrapper>
  );
};

export default Home;
